# Забавные строки
# Демострация конкантнации и повторения строк
print("Две строкие "+"можно клеить с помощью оператора '+'.")
print("\nЭтa строка " + "вряд ли " + "удив" + "ит вас. " \
      + "Но интересно. " + "что" + " она - \n" + "одна длинная-длин"
      + "на" + "я" + "строка. сцепленная "
      + "из " + "двадцати двух\n" + "отдельных строк. разбитых "
      + "на шесть строк."+" Достаточно ли вы"+" впечатлены? "+"Ну хватит.\n"
      + "вот " + "наша " + "длинная" + "строка и закончилась!")
print("Повтоение "*10)
input("Нажмите Enter, чтобы выйти")
