# Компьютерный датчик настроения
# Демонстрирует использование elif
import random
print("Я ощущаю вашу энергетику, от моего экрана не скрыто ни одно из выших чувств.")
print("Итак, ваше настроение...")
mood = random.randint(1,3)
if mood ==1:
    # Радость
    print("""
        ----------------
        ----------------
        |               |
        |               |
        |   0      0    |
        |       <       |
        |   "       "   |
        |    "     "    |
        |       "       |
        ----------------
        ----------------
    """)
elif mood ==2 :
    # Так себе
    print("""
            ----------------
            ----------------
            |               |
            |               |
            |    0     0    |
            |       <       |
            |               |
            |    \"\"\"\"\"\"\"    |
            |               |
            ----------------
            ----------------
        """)
else:
    # Плохое
    print("""
            ----------------
            ----------------
            |               |
            |               |
            |   0      0    |
            |       <       |
            |               |
            |       "       |
            |     "    "    |
            |   "        "  |
            ----------------
            ----------------
        """)
print("Но только сегодня!")
input("Нажмите Enter для выхода")
